experiment-data/k3s/dp_redis_density-4/dp_redis_density/2022-10-28T09-19-14/kbench-pod-oid-0-tid-1/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          603.78          ---          ---        30.03222        24.19100       146.43100       239.61500        46.50 
Gets         6035.99         0.33      6035.66        30.05280        24.19100       147.45500       237.56700       235.12 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       6639.77         0.33      6035.66        30.05093        24.19100       147.45500       237.56700       281.62 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.367        0.000
SET       6.335        5.000
SET       9.727       10.000
SET      12.159       15.000
SET      14.143       20.000
SET      15.871       25.000
SET      17.663       30.000
SET      19.327       35.000
SET      20.863       40.000
SET      22.527       45.000
SET      24.191       50.000
SET      25.087       52.500
SET      25.983       55.000
SET      27.007       57.500
SET      28.031       60.000
SET      29.055       62.500
SET      30.207       65.000
SET      31.487       67.500
SET      32.767       70.000
SET      34.303       72.500
SET      35.839       75.000
SET      36.863       76.250
SET      37.631       77.500
SET      38.655       78.750
SET      39.679       80.000
SET      40.959       81.250
SET      41.983       82.500
SET      43.519       83.750
SET      44.799       85.000
SET      46.591       86.250
SET      48.383       87.500
SET      49.407       88.125
SET      50.431       88.750
SET      51.711       89.375
SET      52.735       90.000
SET      54.271       90.625
SET      55.807       91.250
SET      57.599       91.875
SET      59.391       92.500
SET      61.183       93.125
SET      63.743       93.750
SET      65.023       94.062
SET      67.071       94.375
SET      68.607       94.688
SET      70.655       95.000
SET      72.703       95.312
SET      75.263       95.625
SET      78.335       95.938
SET      81.407       96.250
SET      85.503       96.562
SET      89.599       96.875
SET      92.159       97.031
SET      95.231       97.188
SET      97.791       97.344
SET     100.863       97.500
SET     104.447       97.656
SET     108.031       97.812
SET     111.615       97.969
SET     115.711       98.125
SET     120.319       98.281
SET     124.927       98.438
SET     127.487       98.516
SET     130.559       98.594
SET     133.119       98.672
SET     136.191       98.750
SET     139.263       98.828
SET     142.335       98.906
SET     145.407       98.984
SET     150.527       99.062
SET     154.623       99.141
SET     158.719       99.219
SET     160.767       99.258
SET     163.839       99.297
SET     166.911       99.336
SET     168.959       99.375
SET     172.031       99.414
SET     175.103       99.453
SET     178.175       99.492
SET     182.271       99.531
SET     185.343       99.570
SET     189.439       99.609
SET     190.463       99.629
SET     192.511       99.648
SET     194.559       99.668
SET     196.607       99.688
SET     198.655       99.707
SET     201.727       99.727
SET     204.799       99.746
SET     208.895       99.766
SET     212.991       99.785
SET     216.063       99.805
SET     218.111       99.814
SET     220.159       99.824
SET     222.207       99.834
SET     223.231       99.844
SET     226.303       99.854
SET     229.375       99.863
SET     231.423       99.873
SET     234.495       99.883
SET     237.567       99.893
SET     240.639       99.902
SET     242.687       99.907
SET     245.759       99.912
SET     249.855       99.917
SET     251.903       99.922
SET     253.951       99.927
SET     254.975       99.932
SET     257.023       99.937
SET     259.071       99.941
SET     261.119       99.946
SET     266.239       99.951
SET     266.239       99.954
SET     270.335       99.956
SET     270.335       99.958
SET     272.383       99.961
SET     274.431       99.963
SET     276.479       99.966
SET     278.527       99.968
SET     284.671       99.971
SET     286.719       99.973
SET     292.863       99.976
SET     292.863       99.977
SET     294.911       99.978
SET     296.959       99.979
SET     296.959       99.980
SET     301.055       99.982
SET     303.103       99.983
SET     305.151       99.984
SET     307.199       99.985
SET     309.247       99.987
SET     315.391       99.988
SET     317.439       99.988
SET     317.439       99.989
SET     319.487       99.990
SET     321.535       99.990
SET     323.583       99.991
SET     325.631       99.991
SET     327.679       99.992
SET     329.727       99.993
SET     329.727       99.993
SET     331.775       99.994
SET     333.823       99.994
SET     337.919       99.995
SET     337.919       99.995
SET     339.967       99.995
SET     339.967       99.995
SET     346.111       99.996
SET     354.303       99.996
SET     370.687       99.996
SET     372.735       99.997
SET     374.783       99.997
SET     389.119       99.997
SET     391.167       99.997
SET     391.167       99.997
SET     397.311       99.998
SET     397.311       99.998
SET     401.407       99.998
SET     401.407       99.998
SET     407.551       99.998
SET     407.551       99.998
SET     409.599       99.998
SET     409.599       99.999
SET     409.599       99.999
SET     409.599       99.999
[...]
SET     413.695       99.999
SET     413.695       99.999
SET     413.695       99.999
[...]
SET     415.743       99.999
SET     415.743       99.999
SET     415.743       99.999
[...]
SET     436.223       99.999
SET     436.223      100.000
SET     436.223      100.000
SET     436.223      100.000
[...]
SET     471.039      100.000
SET     471.039      100.000
---
GET       0.327        0.000
GET       6.335        5.000
GET       9.727       10.000
GET      12.159       15.000
GET      14.143       20.000
GET      15.935       25.000
GET      17.663       30.000
GET      19.327       35.000
GET      20.863       40.000
GET      22.527       45.000
GET      24.191       50.000
GET      25.087       52.500
GET      25.983       55.000
GET      27.007       57.500
GET      28.031       60.000
GET      29.055       62.500
GET      30.207       65.000
GET      31.615       67.500
GET      33.023       70.000
GET      34.303       72.500
GET      36.095       75.000
GET      36.863       76.250
GET      37.887       77.500
GET      38.655       78.750
GET      39.935       80.000
GET      40.959       81.250
GET      42.239       82.500
GET      43.519       83.750
GET      45.055       85.000
GET      46.591       86.250
GET      48.383       87.500
GET      49.407       88.125
GET      50.431       88.750
GET      51.711       89.375
GET      52.991       90.000
GET      54.271       90.625
GET      55.807       91.250
GET      57.343       91.875
GET      59.135       92.500
GET      61.183       93.125
GET      63.743       93.750
GET      65.023       94.062
GET      66.559       94.375
GET      68.607       94.688
GET      70.655       95.000
GET      72.703       95.312
GET      75.263       95.625
GET      78.335       95.938
GET      81.919       96.250
GET      85.503       96.562
GET      90.111       96.875
GET      92.671       97.031
GET      95.231       97.188
GET      98.303       97.344
GET     101.375       97.500
GET     104.959       97.656
GET     108.543       97.812
GET     112.127       97.969
GET     116.223       98.125
GET     120.319       98.281
GET     125.439       98.438
GET     127.999       98.516
GET     130.559       98.594
GET     134.143       98.672
GET     136.191       98.750
GET     139.263       98.828
GET     143.359       98.906
GET     146.431       98.984
GET     150.527       99.062
GET     154.623       99.141
GET     158.719       99.219
GET     160.767       99.258
GET     163.839       99.297
GET     165.887       99.336
GET     168.959       99.375
GET     171.007       99.414
GET     175.103       99.453
GET     178.175       99.492
GET     181.247       99.531
GET     184.319       99.570
GET     188.415       99.609
GET     189.439       99.629
GET     191.487       99.648
GET     193.535       99.668
GET     195.583       99.688
GET     197.631       99.707
GET     200.703       99.727
GET     203.775       99.746
GET     207.871       99.766
GET     210.943       99.785
GET     215.039       99.805
GET     216.063       99.814
GET     218.111       99.824
GET     220.159       99.834
GET     222.207       99.844
GET     224.255       99.854
GET     226.303       99.863
GET     229.375       99.873
GET     231.423       99.883
GET     234.495       99.893
GET     238.591       99.902
GET     240.639       99.907
GET     242.687       99.912
GET     244.735       99.917
GET     246.783       99.922
GET     249.855       99.927
GET     252.927       99.932
GET     254.975       99.937
GET     258.047       99.941
GET     261.119       99.946
GET     264.191       99.951
GET     266.239       99.954
GET     268.287       99.956
GET     270.335       99.958
GET     272.383       99.961
GET     276.479       99.963
GET     278.527       99.966
GET     280.575       99.968
GET     284.671       99.971
GET     286.719       99.973
GET     290.815       99.976
GET     292.863       99.977
GET     294.911       99.978
GET     294.911       99.979
GET     296.959       99.980
GET     299.007       99.982
GET     301.055       99.983
GET     305.151       99.984
GET     305.151       99.985
GET     309.247       99.987
GET     313.343       99.988
GET     315.391       99.988
GET     315.391       99.989
GET     317.439       99.990
GET     319.487       99.990
GET     319.487       99.991
GET     321.535       99.991
GET     325.631       99.992
GET     327.679       99.993
GET     331.775       99.993
GET     337.919       99.994
GET     337.919       99.994
GET     337.919       99.995
GET     339.967       99.995
GET     342.015       99.995
GET     346.111       99.995
GET     346.111       99.996
GET     350.207       99.996
GET     356.351       99.996
GET     358.399       99.997
GET     372.735       99.997
GET     374.783       99.997
GET     387.071       99.997
GET     389.119       99.997
GET     393.215       99.998
GET     399.359       99.998
GET     399.359       99.998
GET     401.407       99.998
GET     407.551       99.998
GET     407.551       99.998
GET     409.599       99.998
GET     409.599       99.999
GET     409.599       99.999
GET     409.599       99.999
[...]
GET     411.647       99.999
GET     423.935       99.999
GET     423.935       99.999
GET     423.935       99.999
[...]
GET     425.983       99.999
GET     425.983       99.999
GET     425.983      100.000
GET     432.127      100.000
GET     432.127      100.000
GET     434.175      100.000
GET     434.175      100.000
GET     442.367      100.000
GET     442.367      100.000
GET     442.367      100.000
[...]
GET     444.415      100.000
GET     448.511      100.000
GET     448.511      100.000
GET     460.799      100.000
GET     460.799      100.000
GET     460.799      100.000
[...]
GET     464.895      100.000
GET     464.895      100.000
GET     464.895      100.000
[...]
GET     471.039      100.000
GET     471.039      100.000
GET     471.039      100.000
[...]
GET     475.135      100.000
GET     475.135      100.000
---
WAIT      0.000      100.000